app/Controllers/Capacitaciones.php

SELECT *
FROM `tbl_fechas_capacitacion`
SELECT *
FROM `tbl_fotos_capacitacion`
---
    public function index(){
        $capacitacionModel = model('CapacitacionesModel');
        $fechasCapacitacionModel = model('FechasCapacitacionModel');
        $fotosCapacitacionModel = model('FotosCapacitacionModel');

        $mostrarCapacitacion['datos'] = $capacitacionModel->findAll();
        $mostrarCapacitacion['fechas'] = $fechasCapacitacionModel->findAll();
        $mostrarCapacitacion['fotos'] = $fotosCapacitacionModel->findAll();

INSERT INTO `tbl_fotos_capacitacion` (`url`, `idCapacitacion`, `date_create`, `date_update`) VALUES ('AIRBNBBBDD.png', 6, '2022-09-21 13:10:04', '2022-09-21 13:10:04')
---
                'url' => $direccion,
                'idCapacitacion' => $id
            ];
            $fotosCapacitacionModel->save($guardar);

INSERT INTO `tbl_fechas_capacitacion` (`fechaInicio`, `fechaFinal`, `idCapacitacion`, `date_create`, `date_update`) VALUES ('2022-01-21', '2022-02-10', 6, '2022-09-21 13:10:04', '2022-09-21 13:10:04')
---
                'fechaFinal' => $fechaFinal[$i],
                'idCapacitacion' => $id
            ];
            $fechasCapacitacionModel->save($guardar);

SELECT *
FROM `tbl_fechas_capacitacion`
WHERE `idCapacitacion` = '8'
SELECT *
FROM `tbl_fotos_capacitacion`
WHERE `idCapacitacion` = '8'
---
    public function show($id){
        $capacitacionModel = model('CapacitacionesModel');
        $fechasCapacitacionModel = model('FechasCapacitacionModel');
        $fotosCapacitacionModel = model('FotosCapacitacionModel');

        $mostrarCapacitacion['datos'] = $capacitacionModel->where('idCapacitacion',$id)->findAll();
        $mostrarCapacitacion['fechas'] = $fechasCapacitacionModel->where('idCapacitacion',$id)->findAll();
        $mostrarCapacitacion['fotos'] = $fotosCapacitacionModel->where('idCapacitacion',$id)->findAll();