app/Controllers/Capacitaciones.php

            $mostrarCapacitacion['fechas'] = $fechasCapacitacionModel->findAll();
            $mostrarCapacitacion['fotos'] = $fotosCapacitacionModel->findAll();
        }elseif($_COOKIE['idRol'] == '2'){
            $arrayUsuarios = $usuarioModel->where('idDepartamento',$_COOKIE['idDepartamento'])->findColumn('idUsuario');
            $arrayCapacitacion = $capacitacionModel->whereIn('idUsuario',$arrayUsuarios)->findColumn('idCapacitacion');
            $mostrarCapacitacion['datos'] = $capacitacionModel->whereIn('idUsuario',$arrayUsuarios)->findAll();
            $mostrarCapacitacion['fechas'] = $fechasCapacitacionModel->whereIn('idCapacitacion',$arrayCapacitacion)->findAll();
            $mostrarCapacitacion['fotos'] = $fotosCapacitacionModel->whereIn('idCapacitacion',$arrayCapacitacion)->findAll();
        }elseif($_COOKIE['idRol'] == '3'){
            $arrayCapacitacion[] = $capacitacionModel->where('idUsuario',$_COOKIE['idUsuario'])->findColumn('idCapacitacion');
            $mostrarCapacitacion['datos'] = $capacitacionModel->where('idUsuario',$_COOKIE['idUsuario'])->findAll();
            $mostrarCapacitacion['fechas'] = $fechasCapacitacionModel->whereIn('idCapacitacion',$arrayCapacitacion)->findAll();
            $mostrarCapacitacion['fotos'] = $fotosCapacitacionModel->whereIn('idCapacitacion',$arrayCapacitacion)->findAll();
---
SELECT `idUsuario`
FROM `tbl_usuarios`
WHERE `idDepartamento` = '3'
SELECT *
FROM `tbl_fechas_capacitacion`
WHERE `idCapacitacion` IN ('10')
SELECT *
FROM `tbl_fotos_capacitacion`
WHERE `idCapacitacion` IN ('10')
SELECT *
FROM `tbl_fechas_capacitacion`
WHERE `idCapacitacion` IN (NULL)
SELECT *
FROM `tbl_fotos_capacitacion`
WHERE `idCapacitacion` IN (NULL)

                'url' => $direccionGuardado,
                'idCapacitacion' => $id
            ];
            $fotosCapacitacionModel->save($guardar);
---
INSERT INTO `tbl_fotos_capacitacion` (`url`, `idCapacitacion`, `date_create`, `date_update`) VALUES ('apitechhousing.test/img/capacitacionesGalerias/9/GsnM6kBpP1jSJKOy.jpg', 9, '2022-09-28 11:49:06', '2022-09-28 11:49:06')

                'fechaFinal' => $fechaFinal[$i],
                'idCapacitacion' => $id
            ];
            $fechasCapacitacionModel->save($guardar);
---
INSERT INTO `tbl_fechas_capacitacion` (`fechaInicio`, `fechaFinal`, `idCapacitacion`, `date_create`, `date_update`) VALUES ('2019-05-15', '2020-01-19', 9, '2022-09-28 11:49:06', '2022-09-28 11:49:06')