app/Controllers/Misiones.php

SELECT *
FROM `tbl_fechas_mision`
SELECT *
FROM `tbl_fotos_mision`
---
    public function index(){
        if(!isset($_COOKIE['idRol'])){
            return $this->getResponse([
                'message' => 'Error'
            ]);
        }
        if(!isset($_COOKIE['idUsuario'])){
            return $this->getResponse([
                'message' => 'Error'
            ]);
        }
        if(!isset($_COOKIE['idDepartamento'])){
            return $this->getResponse([
                'message' => 'Error'
            ]);
        }
        if($_COOKIE['idRol'] == null){
            return $this->getResponse([
                'message' => 'Error'
            ]);
        }

        $misionModel = model('MisionesModel');
        $fechasMisionModel = model('FechasMisionesModel');
        $fotosMisionModel = model('FotosMisionesModel');
        $usuarioModel = model('UserModel');

        $mostrarMision['datos'] = $misionModel->findAll();
        $mostrarMision['fechas'] = $fechasMisionModel->findAll();
        $mostrarMision['fotos'] = $fotosMisionModel->findAll();

SELECT `idFechaMision`
FROM `tbl_fechas_mision`
WHERE `idMisionInstitucional` = '7'
---
    public function delete($id){
        $misionModel = model('MisionesModel');
        $fechasMisionModel = model('FechasMisionesModel');
        $fotosMisionModel = model('FotosMisionesModel');

        $arrayFechas = $fechasMisionModel->where('idMisionInstitucional',$id)->findColumn('idFechaMision');