app/Controllers/Reportes.php

SELECT `idUsuario`
FROM `tbl_usuarios`
WHERE `idUsuario` = ''
---

            }elseif($input['tipoReporte'] == 'usuario'){
                if (!isset($_POST['idUsuario'])){
                    $arrayUsuario = $usuarioModel->findColumn('idUsuario');