app/Models/CapacitacionesModel.php

    public function buscarCapacitacion($id) {
        $user = $this->asArray()->where(['idCapacitacion' => $id])->first();
---
SELECT *
FROM `tbl_capacitaciones`
WHERE `idCapacitacion` = 9
 LIMIT 1